# Pandas

## Series

#### Importing libraries

In [1]:
import numpy as np
import pandas as pd

#### Creating series from various object types - list, array, dictionary

In [2]:
headings = ['a', 'b', 'c']
list1 = [11,22,33]
arr1 = np.array(list1)
dict1 = {'a':11, 'b':22, 'c':33}

In [3]:
headings

['a', 'b', 'c']

In [4]:
list1

[11, 22, 33]

In [5]:
arr1

array([11, 22, 33])

In [6]:
dict1

{'a': 11, 'b': 22, 'c': 33}

#### Passing the data argument when creating series

In [7]:
pd.Series(data = list1)

0    11
1    22
2    33
dtype: int64

In [9]:
pd.Series(arr1)

0    11
1    22
2    33
dtype: int32

In [11]:
pd.Series(dict1)

a    11
b    22
c    33
dtype: int64

In [12]:
pd.Series(headings)

0    a
1    b
2    c
dtype: object

#### Passing the index values for customising.

In [8]:
pd.Series(data = list1, index = headings)

a    11
b    22
c    33
dtype: int64

#### Obtaining information from series.

In [13]:
series1 = pd.Series(dict1)

In [14]:
series1

a    11
b    22
c    33
dtype: int64

In [15]:
series1['a']

11

#### Operations on series

In [16]:
dict2 = {'a':1, 'b':2, 'd':3}

In [17]:
series2 = pd.Series(dict2)

In [18]:
series2

a    1
b    2
d    3
dtype: int64

In [19]:
series1

a    11
b    22
c    33
dtype: int64

Where there is a match, the operation is performed. When no match, null value is returned.

In [20]:
series1 + series2

a    12.0
b    24.0
c     NaN
d     NaN
dtype: float64

## DataFrames

#### Creating dataframe

In [3]:
from numpy.random import randn

The arguments passed are the values of the dataframe, the labels of the row and column. An important thing to note is that dataframes are built upon series. Below the columns 'y' and 'z' are series only which share the common index. And the rows are also series.

In [5]:
dataframe = pd.DataFrame(randn(3,2), ['a','b','c'], ['y', 'z'])

In [6]:
dataframe

          y         z
a  0.079911 -0.492404
b  0.561538 -0.585436
c -0.557171 -0.892137

In [9]:
type(dataframe)

pandas.core.frame.DataFrame

#### Obtaining information from the columns of dataframes using brackets and the SQL dot notation.

In [7]:
dataframe['z']

a   -0.492404
b   -0.585436
c   -0.892137
Name: z, dtype: float64

In [8]:
type(dataframe['z'])

pandas.core.series.Series

In [10]:
dataframe.z

a   -0.492404
b   -0.585436
c   -0.892137
Name: z, dtype: float64

In [11]:
dataframe[['y','z']]

          y         z
a  0.079911 -0.492404
b  0.561538 -0.585436
c -0.557171 -0.892137

#### Creating a new column.

In [12]:
dataframe['new_col'] = dataframe['y'] - dataframe['z']

In [13]:
dataframe

          y         z   new_col
a  0.079911 -0.492404  0.572315
b  0.561538 -0.585436  1.146974
c -0.557171 -0.892137  0.334966

#### Dropping columns.

The axis has is an argument of the drop method which is zero by default. To drop a column, the axis value should be 1.

In [15]:
dataframe.drop('new_col', axis = 1)

          y         z
a  0.079911 -0.492404
b  0.561538 -0.585436
c -0.557171 -0.892137

But this drop method is not inplace. That means the drop is not permanent. If the dataframe is printed again then the dropped column will be seen.

In [16]:
dataframe

          y         z   new_col
a  0.079911 -0.492404  0.572315
b  0.561538 -0.585436  1.146974
c -0.557171 -0.892137  0.334966

To make it occur inplace, we mention the inplace argument as true.

In [17]:
dataframe.drop('new_col', axis = 1, inplace = True)

In [18]:
dataframe

          y         z
a  0.079911 -0.492404
b  0.561538 -0.585436
c -0.557171 -0.892137

#### Dropping rows.

In [19]:
dataframe.drop('c')

          y         z
a  0.079911 -0.492404
b  0.561538 -0.585436

#### Obtaining information from rows of the dataframe using loc and iloc.

loc is location and it obtains information of the row when the row name is passed. iloc is index based location where in the index of the row is passed. For example, here row 'c' has index value 2.

In [21]:
dataframe.loc['c']

y   -0.557171
z   -0.892137
Name: c, dtype: float64

In [22]:
type(dataframe.loc['c'])

pandas.core.series.Series

In [24]:
dataframe.iloc[2]

y   -0.557171
z   -0.892137
Name: c, dtype: float64

#### Obtaining information with combination of rows and columns.

In [25]:
dataframe.loc['a','z']

-0.4924042937068482

In [26]:
dataframe.loc[['b','c'],['y','z']]

          y         z
b  0.561538 -0.585436
c -0.557171 -0.892137

#### Obtaining information based on conditions.

In [28]:
bool_df = dataframe > 0

In [29]:
bool_df

       y      z
a   True  False
b   True  False
c  False  False

Shows null value where ever the condition is false.

In [30]:
dataframe[bool_df]

          y   z
a  0.079911 NaN
b  0.561538 NaN
c       NaN NaN

In [31]:
dataframe[dataframe<0]

          y         z
a       NaN -0.492404
b       NaN -0.585436
c -0.557171 -0.892137

In [32]:
dataframe['y'] > 0

a     True
b     True
c    False
Name: y, dtype: bool

Note that while grabbing rows, the null values are not shown. Since the values which satisfy the condition are only obtained.

In [33]:
dataframe[dataframe['y']>0]

          y         z
a  0.079911 -0.492404
b  0.561538 -0.585436

In [34]:
dataframe[dataframe['z']<0]['y']

a    0.079911
b    0.561538
c   -0.557171
Name: y, dtype: float64

Applying multiple conditions. Make sure that you use '&' instead of 'and' and '|' instead of 'or'. This is because the conditions compared are in the boolean form. 'and' and 'or' work only on single bollean values and not on series of boolean values.

In [36]:
dataframe[(dataframe['y']>0) & (dataframe['z']<0)]

          y         z
a  0.079911 -0.492404
b  0.561538 -0.585436

#### Dealing with indexes.

To reset the indexes or the row label, do the following. Again this does not occur inplace, so it has to be mentioned in the arguments.

In [37]:
dataframe

          y         z
a  0.079911 -0.492404
b  0.561538 -0.585436
c -0.557171 -0.892137

In [38]:
dataframe.reset_index()

  index         y         z
0     a  0.079911 -0.492404
1     b  0.561538 -0.585436
2     c -0.557171 -0.892137

To set index, we can create a new column and add it to the datafrme and then set it. Again the set index method is not inplace. It has to be mentioned explicitly.

In [39]:
new_index = 'aa bb cc'.split()

In [40]:
new_index

['aa', 'bb', 'cc']

In [42]:
dataframe['new_col'] = new_index

In [43]:
dataframe

          y         z new_col
a  0.079911 -0.492404      aa
b  0.561538 -0.585436      bb
c -0.557171 -0.892137      cc

In [44]:
dataframe.set_index('new_col')

                y         z
new_col
aa       0.079911 -0.492404
bb       0.561538 -0.585436
cc      -0.557171 -0.892137

#### Dealing with multi-level index.

We start off by creating the index levels by forming two lists, then zipping it into a tuple and then calling the pandas method which creates the multi-index.

In [45]:
list1 = ['a', 'a', 'a', 'b', 'b', 'b']
list2 = [11,22,33,11,22,33]

In [47]:
index_level = list(zip(list1,list2))
index_level

[('a', 11), ('a', 22), ('a', 33), ('b', 11), ('b', 22), ('b', 33)]

In [49]:
index_level = pd.MultiIndex.from_tuples(index_level)
index_level

MultiIndex([('a', 11),
            ('a', 22),
            ('a', 33),
            ('b', 11),
            ('b', 22),
            ('b', 33)],
           )

So as you can see, there is index 'a' and 'b' which has sub parts 11,22,33 and inside it are the values. This is the index hierarchy.

In [50]:
dataframe2 = pd.DataFrame(randn(6,2), index_level, ['Y','Z'])
dataframe2

             Y         Z
a 11  0.816788 -1.453178
  22  0.391026 -0.522579
  33  1.441272  1.962443
b 11 -1.015193 -0.186813
  22  0.161804  1.397325
  33 -1.915826  1.033368

In [51]:
dataframe2.loc['a']

           Y         Z
11  0.816788 -1.453178
22  0.391026 -0.522579
33  1.441272  1.962443

In [52]:
dataframe2.loc['a'].loc[22]

Y    0.391026
Z   -0.522579
Name: 22, dtype: float64

Naming the indexes.

In [53]:
dataframe2.index.names

FrozenList([None, None])

In [54]:
dataframe2.index.names = ['outside', 'inside']

In [55]:
dataframe2

                       Y         Z
outside inside
a       11      0.816788 -1.453178
        22      0.391026 -0.522579
        33      1.441272  1.962443
b       11     -1.015193 -0.186813
        22      0.161804  1.397325
        33     -1.915826  1.033368

Obtaining the cross-section in a multi-level indexed dataframe. When the index 'a' is called, it only results in displaying the part of 'a'.

In [60]:
dataframe2.xs('a')

               Y         Z
inside
11      0.816788 -1.453178
22      0.391026 -0.522579
33      1.441272  1.962443

In case you want the sub part '22' of both indexs 'a' and 'b', you do the following.

In [61]:
dataframe2.xs(22, level = 'inside')

                Y         Z
outside
a        0.391026 -0.522579
b        0.161804  1.397325

## Using Pandas to deal with missing data

To denote null values, use np.nan.

In [62]:
dataframe3 = {'x':[11,22,np.nan], 'y':[33, np.nan,np.nan], 'z':[44,55,66]}

In [65]:
df = pd.DataFrame(dataframe3)
df

      x     y   z
0  11.0  33.0  44
1  22.0   NaN  55
2   NaN   NaN  66

#### Dropping NaN values.

Now let's drop the missing values from the dataframe. It drops the rows with missing values since the default argument axis= 0.

In [66]:
df.dropna()

      x     y   z
0  11.0  33.0  44

If you want to drop columns where there are null values, mention axis = 1.

In [68]:
df.dropna(axis=1)

    z
0  44
1  55
2  66

There is another argument called thresh which takes in integer value. The integer value denotes the threshold for how many minimum non-Nan values should be present. So as you can see, the second row is retained since it has 2 non-Nan values when 2 is given as the value of thresh.

In [70]:
df.dropna(thresh=2)

      x     y   z
0  11.0  33.0  44
1  22.0   NaN  55

#### Filling NaN values.

In [71]:
df.fillna(value='A values if filled')

                    x                   y   z
0                  11                  33  44
1                  22  A values if filled  55
2  A values if filled  A values if filled  66

Usually the mean is filled in place of NaN values.

In [73]:
df['x'].fillna(value=df['x'].mean())

0    11.0
1    22.0
2    16.5
Name: x, dtype: float64